src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций/ОсновныеНачисленияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисленияОрганизаций</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</baseCalculationTypes>
  <predefined>
    <items>
      <name>УдалитьПростойОкладПоДням</name>
      <description>(Не использовать) Оплата простоя от оклада по дням</description>
    </items>
    <items>
      <name>УдалитьПростойОкладПоЧасам</name>
      <description>(Не использовать) Оплата простоя от оклада по часам</description>
    </items>
    <items>
      <name>УдалитьПростойТарифДневной</name>
      <description>(Не использовать) Оплата простоя по дневному тарифу</description>
    </items>
    <items>
      <name>АвторскоеВознаграждение</name>
      <description>Авторское вознаграждение</description>
    </items>
    <items>
      <name>ОплатаБЛПоТравмеВБыту</name>
      <description>БЛ по травме в быту (не оплачивается)</description>
    </items>
    <items>
      <name>БлаготворительнаяПомощь</name>
      <description>Благотворительная помощь</description>
    </items>
    <items>
      <name>ВыслугаЛет</name>
      <description>Выслуга лет</description>
    </items>
    <items>
      <name>ВыслугаЛетЕжемесячно</name>
      <description>Выслуга лет ежемесячно</description>
    </items>
    <items>
      <name>ВыходноеПособие</name>
      <description>Выходное пособие</description>
    </items>
    <items>
      <name>Годовая</name>
      <description>Годовая</description>
    </items>
    <items>
      <name>ДивидендыАкционеров</name>
      <description>Дивиденды акционеров</description>
    </items>
    <items>
      <name>ДивидендыРаботников</name>
      <description>Дивиденды работников</description>
    </items>
    <items>
      <name>ДниНеоплачиваемыеСогласноТабелю</name>
      <description>Дни неоплачиваемые согласно табелю</description>
    </items>
    <items>
      <name>ДоговорПодряда</name>
      <description>Договор подряда</description>
    </items>
    <items>
      <name>ДоговорПодрядаСПД</name>
      <description>Договор подряда (для СПД)</description>
    </items>
    <items>
      <name>ДоплатаДоСреднего</name>
      <description>Доплата до среднего</description>
    </items>
    <items>
      <name>ДоплатаЗаВечерниеЧасы</name>
      <description>Доплата за вечерние часы</description>
    </items>
    <items>
      <name>ДоплатаЗаНочныеЧасы</name>
      <description>Доплата за ночные часы</description>
    </items>
    <items>
      <name>ДоплатаЗаПраздничныеИВыходные</name>
      <description>Доплата за работу в праздники и выходные</description>
    </items>
    <items>
      <name>ДополнительныйЕжегодныйОтпуск</name>
      <description>Дополнительный ежегодный отпуск</description>
    </items>
    <items>
      <name>ДополнительныйОтпускНаДетей</name>
      <description>Дополнительный отпуск на детей</description>
    </items>
    <items>
      <name>Замещение</name>
      <description>Замещение</description>
    </items>
    <items>
      <name>ИндексацияЗарплаты</name>
      <description>Индексация зарплаты</description>
    </items>
    <items>
      <name>ИндексацияСоцстрах</name>
      <description>Индексация соцстрах</description>
    </items>
    <items>
      <name>ИндексацияСоцстрахНесч</name>
      <description>Индексация соцстрах несч</description>
    </items>
    <items>
      <name>Квартальная</name>
      <description>Квартальная</description>
    </items>
    <items>
      <name>КомпенсацияЗарплаты</name>
      <description>Компенсация зарплаты</description>
    </items>
    <items>
      <name>КомпенсацияОтпуска</name>
      <description>Компенсация отпуска</description>
    </items>
    <items>
      <name>КомпенсацияПодотчетныхДС</name>
      <description>Компенсация подотчетных ДС</description>
    </items>
    <items>
      <name>Месячная</name>
      <description>Месячная</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>ОкладПоЧасам</name>
      <description>Оклад по часам</description>
    </items>
    <items>
      <name>ОплатаБЛПоТравмеНаПроизводстве</name>
      <description>Оплата БЛ по травме на производстве</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛ</name>
      <description>Оплата больничных листов</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛОрганизации</name>
      <description>Оплата больничных листов (первые 5 дней)</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтп</name>
      <description>Оплата отпуска</description>
    </items>
    <items>
      <name>ТарифДневной</name>
      <description>Оплата по дневному тарифу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Оплата по производственным нарядам</description>
    </items>
    <items>
      <name>ОплатаПоСреднему</name>
      <description>Оплата по среднему заработку</description>
    </items>
    <items>
      <name>ТарифЧасовой</name>
      <description>Оплата по часовому тарифу</description>
    </items>
    <items>
      <name>ПочасовойПростой</name>
      <description>Оплата почасового простоя (не по вине работника)</description>
    </items>
    <items>
      <name>ПочасовойПростойПоСредней</name>
      <description>Оплата почасового простоя (по средней)</description>
    </items>
    <items>
      <name>ОплатаПраздничныхИВыходных</name>
      <description>Оплата праздничных и выходных дней</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Оплата простоя (не по вине работника)</description>
    </items>
    <items>
      <name>ПростойПоСредней</name>
      <description>Оплата простоя (по средней)</description>
    </items>
    <items>
      <name>ОплатаСверхурочных</name>
      <description>Оплата сверхурочных часов</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчет</name>
      <description>Отпуск за свой счет</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчетПоСоглашению</name>
      <description>Отпуск за свой счет по соглашению сторон</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенкомБезОплаты</name>
      <description>Отпуск по уходу за ребенком без оплаты</description>
    </items>
    <items>
      <name>НевыходРегл</name>
      <description>Отсутствие по невыясненной причине</description>
    </items>
    <items>
      <name>НаПогребение</name>
      <description>Помощь на погребение</description>
    </items>
    <items>
      <name>ПриРожденииРебенка</name>
      <description>Помощь при рождении ребенка</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо3Лет</name>
      <description>Пособие по уходу за ребёнком до 3 лет</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул, простой по вине работника</description>
    </items>
    <items>
      <name>СдельнаяОплатаГПХ</name>
      <description>Сдельная оплата ГПХ</description>
    </items>
    <items>
      <name>Совмещение</name>
      <description>Совмещение</description>
    </items>
    <items>
      <name>СтажВДнях</name>
      <description>Стаж в днях</description>
    </items>
    <items>
      <name>СтажВЧасах</name>
      <description>Стаж в часах</description>
    </items>
    <items>
      <name>ВозвратОтпуска</name>
      <description>Удержание за использованный авансом отпуск</description>
    </items>
    <items>
      <name>УчебныйОтпуск</name>
      <description>Учебный отпуск</description>
    </items>
    <items>
      <name>ОтпускБезОплатыУчебный</name>
      <description>Учебный отпуск без оплаты</description>
    </items>
    <items>
      <name>ЧернобыльскийОтпуск</name>
      <description>Чернобыльский отпуск</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетНормыВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальнаяГруппа</name>
    <comment>Используется для расчета индексации</comment>
    <type>
      <types>EnumRef.СоциальныеГруппыНаселения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказателиВидовОплатыТруда</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетКалендарных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетВводаТарифногоРазряда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСтажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоходомВНатуральнойФорме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяцев</name>
    <comment>Используется в расчете средней, для определения средней суммы премии за месяц</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаПоНазначению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеВТабелеУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИспользованияРабочегоВремени</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяФормулаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыРасчетов77</name>
    <comment>Используется для переноса из ЗИК 7.7</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБольничные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеЗаСчетФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСхемМотивации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиватьПриКадровыхПеремещениях</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет обновление реквизитов "ЗачетОтработанногоВремени" и
// "ЗачетНормыВремени" в зависимости от значения ОбозначениеВТабелеУчетаРабочегоВремени.ВидВремени
//
// Параметры:
//  Нет.
//
Процедура ОбновитьПризнакиУчетаВремени() Экспорт
	
	Если ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени 			= Истина;
		ЗачетКалендарных			= Истина;

	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени 			= Ложь;
		ЗачетКалендарных			= Ложь;

	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное Тогда
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Истина;
		ЗачетКалендарных			= Истина;

	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное Тогда
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Истина;
		ЗачетКалендарных			= Ложь;

	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени			= Истина;
		ЗачетКалендарных			= Ложь;

	Иначе
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Ложь;
		ЗачетКалендарных			= Ложь;

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда // проверки не выполняем
		Возврат
	КонецЕсли;
	
	Если ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы Тогда
		Если ОбозначениеВТабелеУчетаРабочегоВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ВидВремени) и ВидВремени <> Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы Тогда
		Если ОбозначениеВТабелеУчетаРабочегоВремени.Пустая() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Для начисления, по которому регистрируется отработанное (или неотработанное время), необходимо задать конкретный вид времени по классификатору использования рабочего времени!", Отказ);
		ИначеЕсли (ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное 
			Или ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное) и ОбозначениеВТабелеУчетаРабочегоВремени.РабочееВремя Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		ИначеЕсли (ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы 
			Или ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы) и Не ОбозначениеВТабелеУчетаРабочегоВремени.РабочееВремя Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// Описание текста запроса:
	// Первая часть запроса - поиск видов расчета, которые вытесняЮт текущий, являющийся почасовым отклонением: 
	//		Выбираются виды расчета, которые вытесняЕт текущий, проверяется отсутствие таких видов
	//
	// Вторая часть запроса - поиск видов расчета, которые вытесняЕт текущий, являющийся почасовым отклонением: 
	//		Выбираются виды расчета, которые вытесняЕт текущий, проверяется отсутствие таких видов
	//
	// Третья часть запроса - поиск видов расчета, являющихся почасовыми отклонениями, которые вытесняЮт текущий: 
	//		Для вида расчета, не являющегося почасовым отклонением, поиск вытесняющий его видов - почасовых отклонений
	// 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСсылка", Ссылка);
	НецелосменноеВремя = Новый Массив;
	НецелосменноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	НецелосменноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("НецелосменноеВремя", НецелосменноеВремя);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Для нецелодевных начислений нельзя назначать вытесняющие виды расчета"" КАК ОписаниеКонфликта
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*) КАК КоличествоВР
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняющиеВР
	|	ГДЕ
	|		ВытесняющиеВР.Ссылка = &парамСсылка
	|		И ВытесняющиеВР.Ссылка.ВидВремени В(&НецелосменноеВремя)) КАК ДанныеПоВытесняющимВР
	|ГДЕ
	|	ДанныеПоВытесняющимВР.КоличествоВР > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Недопустимо назначение нецелодевного начисления '"" + ОсновныеНачисления.Ссылка.Наименование + ""' как вытесняющего для '"" + ВытесняемыеНачисления.Ссылка.Наименование + ""'""
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняемыеНачисления
	|		ПО ОсновныеНачисления.Ссылка = ВытесняемыеНачисления.ВидРасчета
	|ГДЕ
	|	ОсновныеНачисления.Ссылка = &парамСсылка
	|	И ОсновныеНачисления.ВидВремени В(&НецелосменноеВремя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Недопустимо назначение нецелодевного начисления '"" + ВытесняющиеВР.ВидРасчета.Наименование + ""' в качестве вытесняющего вида расчета""
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняющиеВР
	|ГДЕ
	|	ВытесняющиеВР.Ссылка = &парамСсылка
	|	И ВытесняющиеВР.ВидРасчета.ВидВремени В(&НецелосменноеВремя)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОписаниеКонфликта) Тогда
			ТекстСообщения = Выборка.ОписаниеКонфликта; 
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
